from Header import r
# Задание 1.
# Описать функцию R (N), которая по заданному значению произвольного натурального числа
# определит его разрядность. Обратиться к функции со значениями 3, 13, 130, 1300, 13000.
# n = int(input("Введите число: "))
print(f"Число {3}, его разрядность = {r(3)}")
print(f"Число {13}, его разрядность = {r(13)}")
print(f"Число {130}, его разрядность = {r(130)}")
print(f"Число {1300}, его разрядность = {r(1300)}")
print(f"Число {13000}, его разрядность = {r(13000)}")
